frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Source/gd32e501_cla.c
/*!
    \file    gd32e501_cla.c
    \brief   CLA driver

    \version 2020-03-02, V1.0.0, firmware for GD32E501
    \version 2020-04-10, V1.0.1, firmware for GD32E501
*/

/*
    Copyright (c) 2020, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32e501_cla.h"

/*!
    \brief      reset CLA
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cla_deinit(void)
{
    rcu_periph_reset_enable(RCU_CLARST);
    rcu_periph_reset_disable(RCU_CLARST);
}

/*!
    \brief      enable CLA
    \param[in]  cla_periph: CLAx(x=0,1,2,3,,4,5,6,7)
    \param[out] none
    \retval     none
*/
void cla_enable(cla_enum cla_periph)
{
    switch(cla_periph){
        case CLA0:
             CLA_GCTL |= CLA_GCTL_CLA0EN;
             break;
        case CLA1:
             CLA_GCTL |= CLA_GCTL_CLA1EN;
             break;
        case CLA2:
             CLA_GCTL |= CLA_GCTL_CLA2EN;
             break;
        case CLA3:
             CLA_GCTL |= CLA_GCTL_CLA3EN;
             break;
        case CLA4:
             CLA_GCTL |= CLA_GCTL_CLA4EN;
             break;
        case CLA5:
             CLA_GCTL |= CLA_GCTL_CLA5EN;
             break;
        case CLA6:
             CLA_GCTL |= CLA_GCTL_CLA6EN;
             break;
        case CLA7:
             CLA_GCTL |= CLA_GCTL_CLA7EN;
             break;
        default: 
             break;
    }
}

/*!
    \brief      disable CLA
    \param[in]  cla_periph: CLAx(x=0,1,2,3,,4,5,6,7)
    \param[out] none
    \retval     none
*/
void cla_disable(cla_enum cla_periph)
{
    switch(cla_periph){
        case CLA0:
             CLA_GCTL &= (~CLA_GCTL_CLA0EN);
             break;
        case CLA1:
             CLA_GCTL &= (~CLA_GCTL_CLA1EN);
             break;
        case CLA2:
             CLA_GCTL &= (~CLA_GCTL_CLA2EN);
             break;
        case CLA3:
             CLA_GCTL &= (~CLA_GCTL_CLA3EN);
             break;
        case CLA4:
             CLA_GCTL &= (~CLA_GCTL_CLA4EN);
             break;
        case CLA5:
             CLA_GCTL &= (~CLA_GCTL_CLA5EN);
             break;
        case CLA6:
             CLA_GCTL &= (~CLA_GCTL_CLA6EN);
             break;
        case CLA7:
             CLA_GCTL &= (~CLA_GCTL_CLA7EN);
             break;
        default: 
             break;
    }
}

/*!
    \brief      get CLA output state
    \param[in]  cla_periph: CLAx(x=0,1,2,3,,4,5,6,7)
    \param[out] none
    \retval     cla_outputstatus_enum: CLA_OUTPUT_HIGH or CLA_OUTPUT_LOW
*/
cla_outputstatus_enum cla_output_state_get(cla_enum cla_periph)
{
    uint32_t state;
    uint32_t returnval;
    
    /* read cla status register */
    state = CLA_STAT;
    
    switch(cla_periph){
        case CLA0:
             returnval = (state & CLA_STAT_CLA0OUT);
             break;
        case CLA1:
             returnval = ((state & CLA_STAT_CLA1OUT)>>1);
             break;
        case CLA2:
             returnval = ((state & CLA_STAT_CLA2OUT)>>2);
             break;
        case CLA3:
             returnval = ((state & CLA_STAT_CLA3OUT)>>3);
             break;
        case CLA4:
             returnval = ((state & CLA_STAT_CLA4OUT)>>4);
             break;
        case CLA5:
             returnval = ((state & CLA_STAT_CLA5OUT)>>5);
             break;
        case CLA6:
             returnval = ((state & CLA_STAT_CLA6OUT)>>6);
             break;
        case CLA7:
             returnval = ((state & CLA_STAT_CLA7OUT)>>7);
             break;
        default:
             returnval = 0;
             break;
    }
    if(CLA_OUTPUT_HIGH == returnval){
        return CLA_OUTPUT_HIGH;
    }else{
        return CLA_OUTPUT_LOW;
    }
}

/*!
    \brief      configure signal selector input
    \param[in]  cla_periph: CLAx(x=0,1,2,3,,4,5,6,7)
    \param[in]  sigs: signal selector
                only one parameter can be selected which is shown as below:
                SIGS0: signal selector 0
                SIGS1: signal selector 1
    \param[in]  input: input of signal selector

     SIGS0 input selection:
     only one parameter can be selected which is shown as below:
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |  SIGS0[4:0]|      CLA0SIGS0             |      CLA1SIGS0             |      CLA2SIGS0             |     CLA3SIGS0            |      CLA4SIGS0             |      CLA5SIGS0             |      CLA6SIGS0             |     CLA7SIGS0            |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00000   | CLA0SIGS0_CLA0_ASYNC_OUT   | CLA1SIGS0_CLA0_ASYNC_OUT   | CLA2SIGS0_CLA0_ASYNC_OUT   | CLA3SIGS0_CLA0_ASYNC_OUT | CLA4SIGS0_CLA0_ASYNC_OUT   | CLA5SIGS0_CLA0_ASYNC_OUT   | CLA6SIGS0_CLA0_ASYNC_OUT   | CLA7SIGS0_CLA0_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00001   | CLA0SIGS0_CLA1_ASYNC_OUT   | CLA1SIGS0_CLA1_ASYNC_OUT   | CLA2SIGS0_CLA1_ASYNC_OUT   | CLA3SIGS0_CLA1_ASYNC_OUT | CLA4SIGS0_CLA1_ASYNC_OUT   | CLA5SIGS0_CLA1_ASYNC_OUT   | CLA6SIGS0_CLA1_ASYNC_OUT   | CLA7SIGS0_CLA1_ASYNC_OUT |
     -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00010   | CLA0SIGS0_CLA2_ASYNC_OUT   | CLA1SIGS0_CLA2_ASYNC_OUT   | CLA2SIGS0_CLA2_ASYNC_OUT   | CLA3SIGS0_CLA2_ASYNC_OUT | CLA4SIGS0_CLA2_ASYNC_OUT   | CLA5SIGS0_CLA2_ASYNC_OUT   | CLA6SIGS0_CLA2_ASYNC_OUT   | CLA7SIGS0_CLA2_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00011   | CLA3SIGS0_CLA3_ASYNC_OUT   | CLA1SIGS0_CLA3_ASYNC_OUT   | CLA2SIGS0_CLA3_ASYNC_OUT   | CLA3SIGS0_CLA3_ASYNC_OUT | CLA4SIGS0_CLA3_ASYNC_OUT   | CLA5SIGS0_CLA3_ASYNC_OUT   | CLA6SIGS0_CLA3_ASYNC_OUT   | CLA7SIGS0_CLA3_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00100   | CLA0SIGS0_TIMER1_TRGO      | CLA1SIGS0_TIMER1_TRGO      | CLA2SIGS0_TIMER1_TRGO      | CLA3SIGS0_TIMER1_TRGO    | CLA4SIGS0_TIMER1_TRGO      | CLA5SIGS0_TIMER1_TRGO      | CLA6SIGS0_TIMER1_TRGO      | CLA7SIGS0_TIMER1_TRGO    |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00101   | CLA0SIGS0_TIMER0_CH0       | CLA1SIGS0_TIMER0_CH0       | CLA2SIGS0_TIMER0_CH1       | CLA3SIGS0_TIMER0_CH2     | CLA4SIGS0_TIMER0_CH0       | CLA5SIGS0_TIMER0_CH0       | CLA6SIGS0_TIMER0_CH1       | CLA7SIGS0_TIMER0_CH2     |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00110   | CLA0SIGS0_TIMER0_CH1       | CLA1SIGS0_TIMER0_CH3       | CLA2SIGS0_TIMER0_CH3       | CLA3SIGS0_TIMER1_CH0     | CLA4SIGS0_TIMER0_CH1       | CLA5SIGS0_TIMER0_CH3       | CLA6SIGS0_TIMER0_CH3       | CLA7SIGS0_TIMER1_CH0     |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00111   | CLA0SIGS0_TIMER0_CH2       | CLA1SIGS0_TIMER1_CH0       | CLA2SIGS0_TIMER1_CH1       | CLA3SIGS0_TIMER1_CH1     | CLA4SIGS0_TIMER0_CH2       | CLA5SIGS0_TIMER1_CH0       | CLA6SIGS0_TIMER1_CH1       | CLA7SIGS0_TIMER1_CH1     |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01000   | CLA0SIGS0_CLAIN0           | CLA1SIGS0_CLAIN4           | CLA2SIGS0_CLAIN0           | CLA3SIGS0_CLAIN2         | CLA4SIGS0_CLAIN0           | CLA5SIGS0_CLAIN4           | CLA6SIGS0_CLAIN0           | CLA7SIGS0_CLAIN2         |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01001   | CLA0SIGS0_CLAIN2           | CLA1SIGS0_CLAIN5           | CLA2SIGS0_CLAIN1           | CLA3SIGS0_CLAIN3         | CLA4SIGS0_CLAIN2           | CLA5SIGS0_CLAIN5           | CLA6SIGS0_CLAIN1           | CLA7SIGS0_CLAIN3         |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01010   | CLA0SIGS0_CLAIN4           | CLA1SIGS0_CLAIN8           | CLA2SIGS0_CLAIN8           | CLA3SIGS0_CLAIN6         | CLA4SIGS0_CLAIN4           | CLA5SIGS0_CLAIN8           | CLA6SIGS0_CLAIN8           | CLA7SIGS0_CLAIN6         |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01011   | CLA0SIGS0_CLAIN6           | CLA1SIGS0_CLAIN10          | CLA2SIGS0_CLAIN9           | CLA3SIGS0_CLAIN7         | CLA4SIGS0_CLAIN6           | CLA5SIGS0_CLAIN10          | CLA6SIGS0_CLAIN9           | CLA7SIGS0_CLAIN7         |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01100   | CLA0SIGS0_CLAIN8           | CLA1SIGS0_CLAIN12          | CLA2SIGS0_CLAIN14          | CLA3SIGS0_CLAIN10        | CLA4SIGS0_CLAIN8           | CLA5SIGS0_CLAIN12          | CLA6SIGS0_CLAIN14          | CLA7SIGS0_CLAIN10        |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01101   | CLA0SIGS0_CLAIN10          | CLA1SIGS0_CLAIN13          | CLA2SIGS0_CLAIN15          | CLA3SIGS0_CLAIN11        | CLA4SIGS0_CLAIN10          | CLA5SIGS0_CLAIN13          | CLA6SIGS0_CLAIN15          | CLA7SIGS0_CLAIN11        |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01110   | CLA0SIGS0_CLAIN12          | CLA1SIGS0_CLAIN16          | CLA2SIGS0_CLAIN16          | CLA3SIGS0_CLAIN18        | CLA4SIGS0_CLAIN12          | CLA5SIGS0_CLAIN16          | CLA6SIGS0_CLAIN16          | CLA7SIGS0_CLAIN18        |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01111   | CLA0SIGS0_CLAIN14          | CLA1SIGS0_CLAIN18          | CLA2SIGS0_CLAIN17          | CLA3SIGS0_CLAIN19        | CLA4SIGS0_CLAIN14          | CLA5SIGS0_CLAIN18          | CLA6SIGS0_CLAIN17          | CLA7SIGS0_CLAIN19        |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    10000   | CLA0SIGS0_CLA4_ASYNC_OUT   | CLA1SIGS0_CLA4_ASYNC_OUT   | CLA2SIGS0_CLA4_ASYNC_OUT   | CLA3SIGS0_CLA4_ASYNC_OUT | CLA4SIGS0_CLA4_ASYNC_OUT   | CLA5SIGS0_CLA4_ASYNC_OUT   | CLA6SIGS0_CLA4_ASYNC_OUT   | CLA7SIGS0_CLA4_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    10001   | CLA0SIGS0_CLA5_ASYNC_OUT   | CLA1SIGS0_CLA5_ASYNC_OUT   | CLA2SIGS0_CLA5_ASYNC_OUT   | CLA3SIGS0_CLA5_ASYNC_OUT | CLA4SIGS0_CLA5_ASYNC_OUT   | CLA5SIGS0_CLA5_ASYNC_OUT   | CLA6SIGS0_CLA5_ASYNC_OUT   | CLA7SIGS0_CLA5_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------                  ------------------------------------------------------------------------------------------------------------------------
     |    10010   |           ---              | CLA1SIGS0_CLA6_ASYNC_OUT   | CLA2SIGS0_CLA6_ASYNC_OUT   | CLA3SIGS0_CLA6_ASYNC_OUT | CLA4SIGS0_CLA6_ASYNC_OUT   | CLA5SIGS0_CLA6_ASYNC_OUT   | CLA6SIGS0_CLA6_ASYNC_OUT   | CLA7SIGS0_CLA6_ASYNC_OUT |
     ------------------------------------------------------------------------------------------------------------- ------------------------------------------------------------------------------------------------------------------------------------
     |    10011   | CLA0SIGS0_CLA7_ASYNC_OUT   | CLA1SIGS0_CLA7_ASYNC_OUT   | CLA2SIGS0_CLA7_ASYNC_OUT   | CLA3SIGS0_CLA_7ASYNC_OUT | CLA4SIGS0_CLA7_ASYNC_OUT   | CLA5SIGS0_CLA7_ASYNC_OUT   | CLA6SIGS0_CLA7_ASYNC_OUT   | CLA7SIGS0_CLA_7ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     SIGS1 input selection:
     only one parameter can be selected which is shown as below:
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |  SIGS1[4:0]|      CLA0SIGS1             |      CLA1SIGS1             |       CLA2SIGS1            |     CLA3SIGS1            |      CLA4SIGS1             |      CLA5SIGS1             |       CLA6SIGS1            |     CLA7SIGS1            |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00000   | CLA0SIGS1_CLA0_ASYNC_OUT   | CLA1SIGS1_CLA0_ASYNC_OUT   | CLA2SIGS1_CLA0_ASYNC_OUT   | CLA3SIGS1_CLA0_ASYNC_OUT | CLA4SIGS1_CLA0_ASYNC_OUT   | CLA5SIGS1_CLA0_ASYNC_OUT   | CLA6SIGS1_CLA0_ASYNC_OUT   | CLA7SIGS1_CLA0_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00001   | CLA0SIGS1_CLA1_ASYNC_OUT   | CLA1SIGS1_CLA1_ASYNC_OUT   | CLA2SIGS1_CLA1_ASYNC_OUT   | CLA3SIGS1_CLA1_ASYNC_OUT | CLA4SIGS1_CLA1_ASYNC_OUT   | CLA5SIGS1_CLA1_ASYNC_OUT   | CLA6SIGS1_CLA1_ASYNC_OUT   | CLA7SIGS1_CLA1_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00010   | CLA0SIGS1_CLA2_ASYNC_OUT   | CLA1SIGS1_CLA2_ASYNC_OUT   | CLA2SIGS1_CLA2_ASYNC_OUT   | CLA3SIGS1_CLA2_ASYNC_OUT | CLA4SIGS1_CLA2_ASYNC_OUT   | CLA5SIGS1_CLA2_ASYNC_OUT   | CLA6SIGS1_CLA2_ASYNC_OUT   | CLA7SIGS1_CLA2_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00011   | CLA0SIGS1_CLA3_ASYNC_OUT   | CLA1SIGS1_CLA3_ASYNC_OUT   | CLA2SIGS1_CLA3_ASYNC_OUT   | CLA3SIGS1_CLA3_ASYNC_OUT | CLA4SIGS1_CLA3_ASYNC_OUT   | CLA5SIGS1_CLA3_ASYNC_OUT   | CLA6SIGS1_CLA3_ASYNC_OUT   | CLA7SIGS1_CLA3_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00100   | CLA0SIGS1_ADC_CONV         | CLA1SIGS1_ADC_CONV         | CLA2SIGS1_ADC_CONV         | CLA3SIGS1_ADC_CONV       | CLA4SIGS1_ADC_CONV         | CLA5SIGS1_ADC_CONV         | CLA6SIGS1_ADC_CONV         | CLA7SIGS1_ADC_CONV       |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00101   | CLA0SIGS1_TIMER0_CH3       | CLA1SIGS1_TIMER0_CH1       | CLA2SIGS1_TIMER0_CH0       | CLA3SIGS1_TIMER0_CH0     | CLA4SIGS1_TIMER0_CH3       | CLA5SIGS1_TIMER0_CH1       | CLA6SIGS1_TIMER0_CH0       | CLA7SIGS1_TIMER0_CH0     |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00110   | CLA0SIGS1_TIMER1_CH0       | CLA1SIGS1_TIMER0_CH2       | CLA2SIGS1_TIMER0_CH2       | CLA3SIGS1_TIMER0_CH1     | CLA4SIGS1_TIMER1_CH0       | CLA5SIGS1_TIMER0_CH2       | CLA6SIGS1_TIMER0_CH2       | CLA7SIGS1_TIMER0_CH1     |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    00111   | CLA0SIGS1_TIMER1_CH1       | CLA1SIGS1_TIMER1_CH1       | CLA2SIGS1_TIMER1_CH0       | CLA3SIGS1_TIMER0_CH3     | CLA4SIGS1_TIMER2_CH1       | CLA5SIGS1_TIMER2_CH1       | CLA6SIGS1_TIMER1_CH0       | CLA7SIGS1_TIMER0_CH3     |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01000   | CLA0SIGS1_CLAIN1           | CLA1SIGS1_CLAIN6           | CLA2SIGS1_CLAIN2           | CLA3SIGS1_CLAIN0         | CLA4SIGS1_CLAIN1           | CLA5SIGS1_CLAIN6           | CLA6SIGS1_CLAIN2           | CLA7SIGS1_CLAIN0         |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01001   | CLA0SIGS1_CLAIN3           | CLA1SIGS1_CLAIN7           | CLA2SIGS1_CLAIN3           | CLA3SIGS1_CLAIN1         | CLA4SIGS1_CLAIN3           | CLA5SIGS1_CLAIN7           | CLA6SIGS1_CLAIN3           | CLA7SIGS1_CLAIN1         |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01010   | CLA0SIGS1_CLAIN5           | CLA1SIGS1_CLAIN9           | CLA2SIGS1_CLAIN10          | CLA3SIGS1_CLAIN4         | CLA4SIGS1_CLAIN5           | CLA5SIGS1_CLAIN9           | CLA6SIGS1_CLAIN10          | CLA7SIGS1_CLAIN4         |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01011   | CLA0SIGS1_CLAIN6           | CLA1SIGS1_CLAIN11          | CLA2SIGS1_CLAIN11          | CLA3SIGS1_CLAIN5         | CLA4SIGS1_CLAIN6           | CLA5SIGS1_CLAIN11          | CLA6SIGS1_CLAIN11          | CLA7SIGS1_CLAIN5         |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01100   | CLA0SIGS1_CLAIN9           | CLA1SIGS1_CLAIN14          | CLA2SIGS1_CLAIN12          | CLA3SIGS1_CLAIN8         | CLA4SIGS1_CLAIN9           | CLA5SIGS1_CLAIN14          | CLA6SIGS1_CLAIN12          | CLA7SIGS1_CLAIN8         |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01101   | CLA0SIGS1_CLAIN11          | CLA1SIGS1_CLAIN15          | CLA2SIGS1_CLAIN13          | CLA3SIGS1_CLAIN9         | CLA4SIGS1_CLAIN11          | CLA5SIGS1_CLAIN15          | CLA6SIGS1_CLAIN13          | CLA7SIGS1_CLAIN9         |
