frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Source/gd32e501_cla.c
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01110   | CLA0SIGS1_CLAIN11          | CLA1SIGS1_CLAIN15          | CLA2SIGS1_CLAIN13          | CLA3SIGS1_CLAIN9         | CLA4SIGS1_CLAIN11          | CLA5SIGS1_CLAIN15          | CLA6SIGS1_CLAIN13          | CLA7SIGS1_CLAIN9         |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    01111   | CLA0SIGS1_CLAIN13          | CLA1SIGS1_CLAIN17          | CLA2SIGS1_CLAIN18          | CLA3SIGS1_CLAIN16        | CLA4SIGS1_CLAIN13          | CLA5SIGS1_CLAIN17          | CLA6SIGS1_CLAIN18          | CLA7SIGS1_CLAIN16        |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    10000   | CLA0SIGS1_CLA4_ASYNC_OUT   | CLA1SIGS1_CLA4_ASYNC_OUT   | CLA2SIGS1_CLA4_ASYNC_OUT   | CLA3SIGS1_CLA4_ASYNC_OUT | CLA4SIGS1_CLA4_ASYNC_OUT   | CLA5SIGS1_CLA4_ASYNC_OUT   | CLA6SIGS1_CLA4_ASYNC_OUT   | CLA7SIGS1_CLA4_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    10001   | CLA0SIGS1_CLA5_ASYNC_OUT   | CLA1SIGS1_CLA5_ASYNC_OUT   | CLA2SIGS1_CLA5_ASYNC_OUT   | CLA3SIGS1_CLA5_ASYNC_OUT | CLA4SIGS1_CLA5_ASYNC_OUT   | CLA5SIGS1_CLA5_ASYNC_OUT   | CLA6SIGS1_CLA5_ASYNC_OUT   | CLA7SIGS1_CLA5_ASYNC_OUT |
     -------------------------------------------------------------------------------------------------------------------------- ------------------------------------------------------------------------------------------------------------------------
     |    10010   |         ---                | CLA1SIGS1_CLA6_ASYNC_OUT   | CLA2SIGS1_CLA6_ASYNC_OUT   | CLA3SIGS1_CLA6_ASYNC_OUT | CLA4SIGS1_CLA6_ASYNC_OUT   | CLA5SIGS1_CLA6_ASYNC_OUT   | CLA6SIGS1_CLA6_ASYNC_OUT   | CLA7SIGS1_CLA6_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
     |    10011   | CLA0SIGS1_CLA7_ASYNC_OUT   | CLA1SIGS1_CLA7_ASYNC_OUT   | CLA2SIGS1_CLA7_ASYNC_OUT   | CLA3SIGS1_CLA7_ASYNC_OUT | CLA4SIGS1_CLA7_ASYNC_OUT   | CLA5SIGS1_CLA7_ASYNC_OUT   | CLA6SIGS1_CLA7_ASYNC_OUT   | CLA7SIGS1_CLA7_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    \param[out] none
    \retval     none
*/
void cla_sigs_input_config(cla_enum cla_periph, cla_sigs_enum sigs, uint32_t input)
{
    if(SIGS0 == sigs){
        CLA_SIGS(cla_periph) &= (~CLA_SIGS_SIGS0);
        CLA_SIGS(cla_periph) |= input;
    }else{
        CLA_SIGS(cla_periph) &= (~CLA_SIGS_SIGS1);
        CLA_SIGS(cla_periph) |= input;
    }
}

/*!
    \brief      configure CLA LCU control register value
    \param[in]  cla_periph: CLAx(x=0,1,2,3,,4,5,6,7)
    \param[in]  lcuctl_value: the value need to set
    \param[out] none
    \retval     none
*/
void cla_lcu_control_config(cla_enum cla_periph, uint8_t lcuctl_value)
{
    CLA_LCUCTL(cla_periph) &= (~CLA_LCU);
    CLA_LCUCTL(cla_periph) |= LCUCTL(lcuctl_value);
}

/*!
    \brief      configure CLA output
    \param[in]  cla_periph: CLAx(x=0,1,2,3,,4,5,6,7)
    \param[in]  output: output of CLA
                only one parameter can be selected which is shown as below:
                FLIP_FLOP_OUTPUT: flip-flop output is selected as CLA output
                LUT_RESULT: LUT result is selected as CLA output
    \param[out] none
    \retval     none
*/
void cla_output_config(cla_enum cla_periph, uint32_t output)
{
    CLA_CTL(cla_periph) &= (~CLA_CTL_OSEL);
    CLA_CTL(cla_periph) |= output;
}

/*!
    \brief      enable CLA output
    \param[in]  cla_periph: CLAx(x=0,1,2,3,,4,5,6,7)
    \param[out] none
    \retval     none
*/
void cla_output_enable(cla_enum cla_periph)
{
    CLA_CTL(cla_periph) |= CLA_CTL_OEN;
}

/*!
    \brief      disable CLA output
    \param[in]  cla_periph: CLAx(x=0,1,2,3,,4,5,6,7)
    \param[out] none
    \retval     none
*/
void cla_output_disable(cla_enum cla_periph)
{
    CLA_CTL(cla_periph) &= (~CLA_CTL_OEN);
}

/*!
    \brief      reset the flip-flop output asynchronously
    \param[in]  cla_periph: CLAx(x=0,1,2,3,,4,5,6,7)
    \param[out] none
    \retval     none
*/
void cla_flip_flop_output_reset(cla_enum cla_periph)
{
    CLA_CTL(cla_periph) |= CLA_CTL_FFRST;
}

/*!
    \brief      configure clock polarity of flip-flop
    \param[in]  cla_periph: CLAx(x=0,1,2,3,,4,5,6,7)
    \param[in]  polarity: clock polarity of flip-flop
                only one parameter can be selected which is shown as below:
                CLA_CLOCKPOLARITY_POSEDGE: clock posedge is valid
                CLA_CLOCKPOLARITY_NEGEDGE: clock negedge is valid
    \param[out] none
    \retval     none
*/
void cla_flip_flop_clockpolarity_config(cla_enum cla_periph, uint32_t polarity)
{
    CLA_CTL(cla_periph) &= (~CLA_CTL_CPOL);
    CLA_CTL(cla_periph) |= polarity;
}

/*!
    \brief      configure clock source of flip-flop 
    \param[in]  cla_periph: CLAx(x=0,1,2,3,,4,5,6,7)
    \param[in]  clock_source: clock source of flip-flop
                only one parameter can be selected which is shown as below:
                PRE_CLA_LUT_RESULT: the result of the previous CLA units
                SIGS0_OUTPUT: the signal selector output of SIGS0
                HCLK: HCLK
                TIMER_TRGO: TIMER_TRGO
    \param[out] none
    \retval     none
*/
void cla_flip_flop_clocksource_config(cla_enum cla_periph, uint32_t clock_source)
{
    CLA_CTL(cla_periph) &= (~CLA_CTL_CSEL);
    CLA_CTL(cla_periph) |= clock_source;
}

/*!
    \brief      check CLA flag is set or not
    \param[in]  flag: CLA flags,refer to cla_flag_enum
                only one parameter can be selected which is shown as below:
                CLA_FLAG_CLA0NF: CLA0 unit negedge flag
                CLA_FLAG_CLA0PF: CLA0 unit posedge flag
                CLA_FLAG_CLA1NF: CLA1 unit negedge flag
                CLA_FLAG_CLA1PF: CLA1 unit posedge flag
                CLA_FLAG_CLA2NF: CLA2 unit negedge flag
                CLA_FLAG_CLA2PF: CLA2 unit posedge flag
                CLA_FLAG_CLA3NF: CLA3 unit negedge flag
                CLA_FLAG_CLA3PF: CLA3 unit posedge flag
                CLA_FLAG_CLA4NF: CLA4 unit negedge flag
                CLA_FLAG_CLA4PF: CLA4 unit posedge flag
                CLA_FLAG_CLA5NF: CLA5 unit negedge flag
                CLA_FLAG_CLA5PF: CLA5 unit posedge flag
                CLA_FLAG_CLA6NF: CLA6 unit negedge flag
                CLA_FLAG_CLA6PF: CLA6 unit posedge flag
                CLA_FLAG_CLA7NF: CLA7 unit negedge flag
                CLA_FLAG_CLA7PF: CLA7 unit posedge flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus cla_flag_get(cla_flag_enum flag)
{
    uint32_t interrupt_flag_register;
    uint32_t returnval;
    
