frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Source/gd32e501_cla.c
    interrupt_flag_register = CLA_INTF;
    
    switch(flag){
        case CLA_FLAG_CLA0NF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA0NF);
             break;
        case CLA_FLAG_CLA0PF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA0PF)>>1;
             break;
        case CLA_FLAG_CLA1NF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA1NF)>>2;
             break;
        case CLA_FLAG_CLA1PF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA1PF)>>3;
             break;
        case CLA_FLAG_CLA2NF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA2NF)>>4;
             break;
        case CLA_FLAG_CLA2PF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA2PF)>>5;
             break;
        case CLA_FLAG_CLA3NF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA3NF)>>6;
             break;
        case CLA_FLAG_CLA3PF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA3PF)>>7;
             break;
        case CLA_FLAG_CLA4NF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA4NF)>>8;
             break;
        case CLA_FLAG_CLA4PF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA4PF)>>9;
             break;
        case CLA_FLAG_CLA5NF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA5NF)>>10;
             break;
        case CLA_FLAG_CLA5PF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA5PF)>>11;
             break;
        case CLA_FLAG_CLA6NF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA6NF)>>12;
             break;
        case CLA_FLAG_CLA6PF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA6PF)>>13;
             break;
        case CLA_FLAG_CLA7NF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA7NF)>>14;
             break;
        case CLA_FLAG_CLA7PF:
             returnval = (interrupt_flag_register & CLA_INTF_CLA7PF)>>15;
             break;
        default:
             returnval = 0;
             break;
    }
    if(SET == returnval){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      clear CLA flag
    \param[in]  flag: CLA flags,refer to cla_flag_enum
                only one parameter can be selected which is shown as below:
                CLA_FLAG_CLA0NF: CLA0 unit negedge flag
                CLA_FLAG_CLA0PF: CLA0 unit posedge flag
                CLA_FLAG_CLA1NF: CLA1 unit negedge flag
                CLA_FLAG_CLA1PF: CLA1 unit posedge flag
                CLA_FLAG_CLA2NF: CLA2 unit negedge flag
                CLA_FLAG_CLA2PF: CLA2 unit posedge flag
                CLA_FLAG_CLA3NF: CLA3 unit negedge flag
                CLA_FLAG_CLA3PF: CLA3 unit posedge flag
                CLA_FLAG_CLA4NF: CLA4 unit negedge flag
                CLA_FLAG_CLA4PF: CLA4 unit posedge flag
                CLA_FLAG_CLA5NF: CLA5 unit negedge flag
                CLA_FLAG_CLA5PF: CLA5 unit posedge flag
                CLA_FLAG_CLA6NF: CLA6 unit negedge flag
                CLA_FLAG_CLA6PF: CLA6 unit posedge flag
                CLA_FLAG_CLA7NF: CLA7 unit negedge flag
                CLA_FLAG_CLA7PF: CLA7 unit posedge flag
    \param[out] none
    \retval     none
*/
void cla_flag_clear(cla_flag_enum flag)
{
    switch(flag){
        case CLA_FLAG_CLA0NF:
             CLA_INTF &= (~CLA_INTF_CLA0NF);
             break;
        case CLA_FLAG_CLA0PF:
             CLA_INTF &= (~CLA_INTF_CLA0PF);
             break;
        case CLA_FLAG_CLA1NF:
             CLA_INTF &= (~CLA_INTF_CLA1NF);
             break;
        case CLA_FLAG_CLA1PF:
             CLA_INTF &= (~CLA_INTF_CLA1PF);
             break;
        case CLA_FLAG_CLA2NF:
             CLA_INTF &= (~CLA_INTF_CLA2NF);
             break;
        case CLA_FLAG_CLA2PF:
             CLA_INTF &= (~CLA_INTF_CLA2PF);
             break;
        case CLA_FLAG_CLA3NF:
             CLA_INTF &= (~CLA_INTF_CLA3NF);
             break;
        case CLA_FLAG_CLA3PF:
             CLA_INTF &= (~CLA_INTF_CLA3PF);
             break;
        case CLA_FLAG_CLA4NF:
             CLA_INTF &= (~CLA_INTF_CLA4NF);
             break;
        case CLA_FLAG_CLA4PF:
             CLA_INTF &= (~CLA_INTF_CLA4PF);
             break;
        case CLA_FLAG_CLA5NF:
             CLA_INTF &= (~CLA_INTF_CLA5NF);
             break;
        case CLA_FLAG_CLA5PF:
             CLA_INTF &= (~CLA_INTF_CLA5PF);
             break;
        case CLA_FLAG_CLA6NF:
             CLA_INTF &= (~CLA_INTF_CLA6NF);
             break;
        case CLA_FLAG_CLA6PF:
             CLA_INTF &= (~CLA_INTF_CLA6PF);
             break;
        case CLA_FLAG_CLA7NF:
             CLA_INTF &= (~CLA_INTF_CLA7NF);
             break;
        case CLA_FLAG_CLA7PF:
             CLA_INTF &= (~CLA_INTF_CLA7PF);
             break;
        default:
            break;
    }
}

/*!
    \brief      enable CLA negedge interrupt
    \param[in]  clanie: CLA negedge interrupt enable
                only one parameter can be selected which is shown as below:
                CLA0NIE: CLA0 negedge interrupt enable
                CLA1NIE: CLA1 negedge interrupt enable
                CLA2NIE: CLA2 negedge interrupt enable
                CLA3NIE: CLA3 negedge interrupt enable
                CLA4NIE: CLA4 negedge interrupt enable
                CLA5NIE: CLA5 negedge interrupt enable
                CLA6NIE: CLA6 negedge interrupt enable
                CLA7NIE: CLA7 negedge interrupt enable
    \param[out] none
    \retval     none
*/
void cla_negedge_interrupt_enable(uint32_t clanie)
{
    CLA_INTE |= clanie;
}

/*!
    \brief      disable CLA negedge interrupt
    \param[in]  clanidis: CLA negedge interrupt disable
                only one parameter can be selected which is shown as below:
                CLA0NI_DISABLE: CLA0 negedge interrupt disable
                CLA1NI_DISABLE: CLA1 negedge interrupt disable
                CLA2NI_DISABLE: CLA2 negedge interrupt disable
                CLA3NI_DISABLE: CLA3 negedge interrupt disable
                CLA4NI_DISABLE: CLA4 negedge interrupt disable
                CLA5NI_DISABLE: CLA5 negedge interrupt disable
                CLA6NI_DISABLE: CLA6 negedge interrupt disable
                CLA7NI_DISABLE: CLA7 negedge interrupt disable
    \param[out] none
    \retval     none
*/
void cla_negedge_interrupt_disable(uint32_t clanidis)
{
    CLA_INTE &= (~clanidis);
}

/*!
    \brief      enable CLA posedge interrupt
    \param[in]  clapie: CLA posedge interrupt enable
                only one parameter can be selected which is shown as below:
                CLA0PIE: CLA0 posedge interrupt enable
                CLA1PIE: CLA1 posedge interrupt enable
                CLA2PIE: CLA2 posedge interrupt enable
                CLA3PIE: CLA3 posedge interrupt enable
                CLA4PIE: CLA4 posedge interrupt enable
                CLA5PIE: CLA5 posedge interrupt enable
                CLA6PIE: CLA6 posedge interrupt enable
                CLA7PIE: CLA7 posedge interrupt enable
    \param[out] none
    \retval     none
*/
void cla_posedge_interrupt_enable(uint32_t clapie)
{
    CLA_INTE |= clapie;
}

/*!
    \brief      disable CLA posedge interrupt
    \param[in]  clapidis: CLA posedge interrupt disable
                only one parameter can be selected which is shown as below:
                CLA0PI_DISABLE: CLA0 posedge interrupt disable
                CLA1PI_DISABLE: CLA1 posedge interrupt disable
                CLA2PI_DISABLE: CLA2 posedge interrupt disable
                CLA3PI_DISABLE: CLA3 posedge interrupt disable
                CLA4PI_DISABLE: CLA4 posedge interrupt disable
                CLA5PI_DISABLE: CLA5 posedge interrupt disable
                CLA6PI_DISABLE: CLA6 posedge interrupt disable
                CLA7PI_DISABLE: CLA7 posedge interrupt disable
    \param[out] none
    \retval     none
*/
void cla_posedge_interrupt_disable(uint32_t clapidis)
{
    CLA_INTE &= (~clapidis);
}

/*!
    \brief      check CLA interrupt flag is set or not 
    \param[in]  int_flag: CLA interrupt flags,refer to cla_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
                CLA_INT_FLAG_CLA0NF: CLA0 unit negedge interrupt flag
                CLA_INT_FLAG_CLA0PF: CLA0 unit posedge interrupt flag
                CLA_INT_FLAG_CLA1NF: CLA1 unit negedge interrupt flag
                CLA_INT_FLAG_CLA1PF: CLA1 unit posedge interrupt flag
                CLA_INT_FLAG_CLA2NF: CLA2 unit negedge interrupt flag
                CLA_INT_FLAG_CLA2PF: CLA2 unit posedge interrupt flag
                CLA_INT_FLAG_CLA3NF: CLA3 unit negedge interrupt flag
                CLA_INT_FLAG_CLA3PF: CLA3 unit posedge interrupt flag
                CLA_INT_FLAG_CLA4NF: CLA4 unit negedge interrupt flag
                CLA_INT_FLAG_CLA4PF: CLA4 unit posedge interrupt flag
                CLA_INT_FLAG_CLA5NF: CLA5 unit negedge interrupt flag
                CLA_INT_FLAG_CLA5PF: CLA5 unit posedge interrupt flag
                CLA_INT_FLAG_CLA6NF: CLA6 unit negedge interrupt flag
                CLA_INT_FLAG_CLA6PF: CLA6 unit posedge interrupt flag
                CLA_INT_FLAG_CLA7NF: CLA7 unit negedge interrupt flag
                CLA_INT_FLAG_CLA7PF: CLA7 unit posedge interrupt flag
    \param[out] none
    \retval     none
*/
FlagStatus cla_interrupt_flag_get(cla_interrupt_flag_enum int_flag)
{
    uint32_t cla_inte = CLA_INTE;
    uint32_t cla_intf = CLA_INTF;
    
    switch(int_flag){
        case CLA_INT_FLAG_CLA0NF:
             cla_inte = cla_inte & CLA_INTE_CLA0NIE;
             cla_intf = cla_intf & CLA_INTF_CLA0NF;
             break;
        case CLA_INT_FLAG_CLA0PF:
             cla_inte = cla_inte & CLA_INTE_CLA0PIE;
             cla_intf = cla_intf & CLA_INTF_CLA0PF;
             break;
        case CLA_INT_FLAG_CLA1NF:
             cla_inte = cla_inte & CLA_INTE_CLA1NIE;
             cla_intf = cla_intf & CLA_INTF_CLA1NF;
             break;
        case CLA_INT_FLAG_CLA1PF:
             cla_inte = cla_inte & CLA_INTE_CLA1PIE;
             cla_intf = cla_intf & CLA_INTF_CLA1PF;
             break;
        case CLA_INT_FLAG_CLA2NF:
             cla_inte = cla_inte & CLA_INTE_CLA2NIE;
             cla_intf = cla_intf & CLA_INTF_CLA2NF;
             break;
        case CLA_INT_FLAG_CLA2PF:
             cla_inte = cla_inte & CLA_INTE_CLA2PIE;
             cla_intf = cla_intf & CLA_INTF_CLA2PF;
             break;
        case CLA_INT_FLAG_CLA3NF:
             cla_inte = cla_inte & CLA_INTE_CLA3NIE;
             cla_intf = cla_intf & CLA_INTF_CLA3NF;
             break;
        case CLA_INT_FLAG_CLA3PF:
             cla_inte = cla_inte & CLA_INTE_CLA3PIE;
             cla_intf = cla_intf & CLA_INTF_CLA3PF;
             break;
        case CLA_INT_FLAG_CLA4NF:
             cla_inte = cla_inte & CLA_INTE_CLA4NIE;
             cla_intf = cla_intf & CLA_INTF_CLA4NF;
             break;
        case CLA_INT_FLAG_CLA4PF:
             cla_inte = cla_inte & CLA_INTE_CLA4PIE;
             cla_intf = cla_intf & CLA_INTF_CLA4PF;
             break;
        case CLA_INT_FLAG_CLA5NF:
             cla_inte = cla_inte & CLA_INTE_CLA5NIE;
             cla_intf = cla_intf & CLA_INTF_CLA5NF;
             break;
        case CLA_INT_FLAG_CLA5PF:
             cla_inte = cla_inte & CLA_INTE_CLA5PIE;
             cla_intf = cla_intf & CLA_INTF_CLA5PF;
             break;
        case CLA_INT_FLAG_CLA6NF:
             cla_inte = cla_inte & CLA_INTE_CLA6NIE;
             cla_intf = cla_intf & CLA_INTF_CLA6NF;
             break;
        case CLA_INT_FLAG_CLA6PF:
             cla_inte = cla_inte & CLA_INTE_CLA6PIE;
             cla_intf = cla_intf & CLA_INTF_CLA6PF;
             break;
        case CLA_INT_FLAG_CLA7NF:
             cla_inte = cla_inte & CLA_INTE_CLA7NIE;
             cla_intf = cla_intf & CLA_INTF_CLA7NF;
             break;
        case CLA_INT_FLAG_CLA7PF:
             cla_inte = cla_inte & CLA_INTE_CLA7PIE;
             cla_intf = cla_intf & CLA_INTF_CLA7PF;
             break;
        default:
             break;
    }
    if((0U != cla_inte) && (0U != cla_intf)){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      clear CLA interrupt flag
    \param[in]  int_flag: CLA interrupt flags,refer to cla_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
                CLA_INT_FLAG_CLA0NF: CLA0 unit negedge interrupt flag
                CLA_INT_FLAG_CLA0PF: CLA0 unit posedge interrupt flag
                CLA_INT_FLAG_CLA1NF: CLA1 unit negedge interrupt flag
                CLA_INT_FLAG_CLA1PF: CLA1 unit posedge interrupt flag
                CLA_INT_FLAG_CLA2NF: CLA2 unit negedge interrupt flag
                CLA_INT_FLAG_CLA2PF: CLA2 unit posedge interrupt flag
                CLA_INT_FLAG_CLA3NF: CLA3 unit negedge interrupt flag
                CLA_INT_FLAG_CLA3PF: CLA3 unit posedge interrupt flag
                CLA_INT_FLAG_CLA4NF: CLA4 unit negedge interrupt flag
                CLA_INT_FLAG_CLA4PF: CLA4 unit posedge interrupt flag
                CLA_INT_FLAG_CLA5NF: CLA5 unit negedge interrupt flag
                CLA_INT_FLAG_CLA5PF: CLA5 unit posedge interrupt flag
                CLA_INT_FLAG_CLA6NF: CLA6 unit negedge interrupt flag
                CLA_INT_FLAG_CLA6PF: CLA6 unit posedge interrupt flag
                CLA_INT_FLAG_CLA7NF: CLA7 unit negedge interrupt flag
                CLA_INT_FLAG_CLA7PF: CLA7 unit posedge interrupt flag
    \param[out] none
    \retval     none
*/
void cla_interrupt_flag_clear(cla_interrupt_flag_enum int_flag)
{
    switch(int_flag){
        case CLA_INT_FLAG_CLA0NF:
             CLA_INTF &= (~CLA_INTF_CLA0NF);
             break;
        case CLA_INT_FLAG_CLA0PF:
             CLA_INTF &= (~CLA_INTF_CLA0PF);
             break;
        case CLA_INT_FLAG_CLA1NF:
             CLA_INTF &= (~CLA_INTF_CLA1NF);
             break;
        case CLA_INT_FLAG_CLA1PF:
             CLA_INTF &= (~CLA_INTF_CLA1PF);
             break;
        case CLA_INT_FLAG_CLA2NF:
             CLA_INTF &= (~CLA_INTF_CLA2NF);
             break;
        case CLA_INT_FLAG_CLA2PF:
             CLA_INTF &= (~CLA_INTF_CLA2PF);
             break;
        case CLA_INT_FLAG_CLA3NF:
             CLA_INTF &= (~CLA_INTF_CLA3NF);
             break;
        case CLA_INT_FLAG_CLA3PF:
             CLA_INTF &= (~CLA_INTF_CLA3PF);
             break;
        case CLA_INT_FLAG_CLA4NF:
             CLA_INTF &= (~CLA_INTF_CLA4NF);
             break;
        case CLA_INT_FLAG_CLA4PF:
             CLA_INTF &= (~CLA_INTF_CLA4PF);
             break;
        case CLA_INT_FLAG_CLA5NF:
             CLA_INTF &= (~CLA_INTF_CLA5NF);
             break;
        case CLA_INT_FLAG_CLA5PF:
             CLA_INTF &= (~CLA_INTF_CLA5PF);
             break;
        case CLA_INT_FLAG_CLA6NF:
             CLA_INTF &= (~CLA_INTF_CLA6NF);
             break;
        case CLA_INT_FLAG_CLA6PF:
             CLA_INTF &= (~CLA_INTF_CLA6PF);
             break;
        case CLA_INT_FLAG_CLA7NF:
             CLA_INTF &= (~CLA_INTF_CLA7NF);
             break;
        case CLA_INT_FLAG_CLA7PF:
             CLA_INTF &= (~CLA_INTF_CLA7PF);
             break;
        default:
             break;
    }
}

